---
kind: method
id: M:Autodesk.Revit.DB.Architecture.StairsRun.GetConnections
source: html/db619f61-5444-37f9-1057-97d35caf5eed.htm
---
# Autodesk.Revit.DB.Architecture.StairsRun.GetConnections Method

Returns information about the connections in which the stairs run participates.
 The stairs run may have no connection, or have at maximum two connections at the lower and upper ends.

## Syntax (C#)
```csharp
public IList<StairsComponentConnection> GetConnections()
```

## Returns
The connections in which the stairs run participates.